app/views/spin_classes/index.html.erb

  <ul id="studio_<%= studio.id %>_spin_classes">
  <% studio.spin_classes.each do |spin_class| %>
---
SELECT "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."studio_id" = ?  [["studio_id", 10]]


      <% if Reservation.find_by(user: current_user, spin_class: spin_class).nil? %>
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."spin_class_id" = ? LIMIT ?  [["user_id", 20], ["spin_class_id", 43], ["LIMIT", 1]]

          <%= f.text_field :name %>
          <%= f.collection_select :studio_id, Studio.all, :id, :name %>
---
SELECT "studios".* FROM "studios"