app/views/spin_classes/new.html.erb

    <%= f.text_field :name %>
    <%= f.collection_select :studio_id, Studio.all, :id, :name %>
---
SELECT "studios".* FROM "studios"