app/views/spin_classes/show.html.erb

<ul>
<% @spin_class.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."spin_class_id" = ?  [["spin_class_id", 14]]