app/controllers/reservations_controller.rb

  def index
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def new
    @spin_class = SpinClass.find(params[:spin_class_id])
---
SELECT  "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @reservation = Reservation.find_by(user_id: current_user.id, id: params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."id" = ? LIMIT ?  [["user_id", 11], ["id", 14], ["LIMIT", 1]]

  def create
    @spin_class = SpinClass.find(params[:spin_class_id])
    # @reservation = Reservation.new(reservation_params)
    # @reservation.spin_class = @spin_class
    @reservation = @spin_class.reservations.new(reservation_params)
    @reservation.user = current_user

    if @reservation.save
---
SELECT  "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "spin_class_id", "created_at", "updated_at", "guests") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["spin_class_id", 11], ["created_at", "2019-06-11 12:27:45.652653"], ["updated_at", "2019-06-11 12:27:45.652653"], ["guests", 2]]