app/controllers/reservations_controller.rb

  def index
    @spin_class = SpinClass.find(params[:spin_class_id])
---
SELECT  "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]