app/controllers/spin_classes_controller.rb

  def index
    @studios = Studio.all
---
SELECT "studios".* FROM "studios"

  def show
    @spin_class = SpinClass.find(params[:id])
---
SELECT  "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @spin_class = SpinClass.new(spin_class_params)
    if @spin_class.save
---
INSERT INTO "spin_classes" ("name", "created_at", "updated_at", "studio_id") VALUES (?, ?, ?, ?)  [["name", "Boogie Night"], ["created_at", "2019-06-12 14:45:48.683466"], ["updated_at", "2019-06-12 14:45:48.683466"], ["studio_id", 11]]