app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id]) if params[:id].to_i == current_user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]