app/views/studios/show.html.erb

  <ol>
    <% @studio.spin_classes.each do |spin_class| %>
---
SELECT "spin_classes".* FROM "spin_classes" WHERE "spin_classes"."studio_id" = ?  [["studio_id", 10]]